1s/ERP/Conf/Catalogs/Лико_СвойстваМатериала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СвойстваМатериала</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ГруппыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Псевдонимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойМатериал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЛицевойМатериал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлея</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Клей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлейДляЛаминации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_КлейЛаминации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокрытиеРулонногоМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПокрытияРулонногоМатериала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПраймера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КольеИлиМаленькийРадиус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РазрешеноНеПроверено</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этикетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РазрешеноНеПроверено</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЕФлакон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РазрешеноНеПроверено</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеЗаморозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РазрешеноНеПроверено</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧестныйЗнак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РазрешеноНеПроверено</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подложка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Подложка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СвойстваМатериала/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.Наименование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Наименование");
	Объект.Код = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Код");
	
КонецПроцедуры

&НаКлиенте
Процедура ПокрытиеРулонногоМатериалаПриИзменении(Элемент)
	
	Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПокрытиеРулонногоМатериала,"Наименование") = "Без покрытия" Тогда
		Объект.КлейДляЛаминации = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Наименование") И Параметры.Свойство("СозданиеНовогоМатериала") И Параметры.СозданиеНовогоМатериала Тогда
		Элементы.Номенклатура.ТолькоПросмотр = Истина;
		Элементы.Псевдоним.ТолькоПросмотр = Истина;
		Объект.Наименование = Параметры.Наименование;
		НеПроверено = Справочники.Лико_РазрешеноНеПроверено.НеПроверено;
		Объект.КольеИлиМаленькийРадиус = НеПроверено;
		Объект.Этикетка = НеПроверено;
		Объект.ПЕФлакон = НеПроверено;
		Объект.ПослеЗаморозки = НеПроверено;
		Объект.ЧестныйЗнак = НеПроверено;
		СозданиеНовогоМатериала = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если СозданиеНовогоМатериала Тогда
		Закрыть(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Наименование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Наименование");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Код = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"Код");	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ГруппаМатериалов) И НЕ ЗначениеЗаполнено(Объект.Псевдоним) Тогда
		Объект.Псевдоним = СоздатьПсевдоним(Объект.ГруппаМатериалов);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПсевдоним(ГруппаМатериалов)

	ПсевдонимОбъект = Справочники.Лико_Псевдонимы.СоздатьЭлемент();
	ПсевдонимОбъект.ГруппаМатериала = ГруппаМатериалов;
	ПсевдонимОбъект.Записать();
	
	Возврат ПсевдонимОбъект.Ссылка;
	
КонецФункции
